bekencorp/bk_avdk_smp/ap/components/avdk_driver/include/soc/bk7259/h26e_reg.h
// Copyright 2022-2025 Beken
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

// This is a generated file, if you need to modify it, use the script to
// generate and modify all the struct.h, ll.h, reg.h, debug_dump.c files!

#pragma once


#ifdef __cplusplus
extern "C" {
#endif


#define H26E_SW_ENC_01_ADDR (SOC_H26E_REG_BASE + (0x1 << 2))

#define H26E_SW_ENC_01_IRQ_POS (0)
#define H26E_SW_ENC_01_IRQ_MASK (0x1)

#define H26E_SW_ENC_01_IRQ_DIS_POS (1)
#define H26E_SW_ENC_01_IRQ_DIS_MASK (0x1)

#define H26E_SW_ENC_01_FRAME_RDY_STATUS_POS (2)
#define H26E_SW_ENC_01_FRAME_RDY_STATUS_MASK (0x1)

#define H26E_SW_ENC_01_BUS_ERROR_STATUS_POS (3)
#define H26E_SW_ENC_01_BUS_ERROR_STATUS_MASK (0x1)

#define H26E_SW_ENC_01_SW_RESET_POS (4)
#define H26E_SW_ENC_01_SW_RESET_MASK (0x1)

#define H26E_SW_ENC_01_BUFFER_FULL_POS (5)
#define H26E_SW_ENC_01_BUFFER_FULL_MASK (0x1)

#define H26E_SW_ENC_01_TIMEOUT_POS (6)
#define H26E_SW_ENC_01_TIMEOUT_MASK (0x1)

#define H26E_SW_ENC_01_IRQ_LINE_BUFFER_POS (7)
#define H26E_SW_ENC_01_IRQ_LINE_BUFFER_MASK (0x1)

#define H26E_SW_ENC_01_SLICE_RDY_STATUS_POS (8)
#define H26E_SW_ENC_01_SLICE_RDY_STATUS_MASK (0x1)

#define H26E_SW_ENC_01_IRQ_FUSE_ERROR_POS (9)
#define H26E_SW_ENC_01_IRQ_FUSE_ERROR_MASK (0x1)

#define H26E_SW_ENC_01_RESERVED_BIT_10_10_POS (10)
#define H26E_SW_ENC_01_RESERVED_BIT_10_10_MASK (0x1)

#define H26E_SW_ENC_01_TIMEOUT_INT_POS (11)
#define H26E_SW_ENC_01_TIMEOUT_INT_MASK (0x1)

#define H26E_SW_ENC_01_STRM_SEGMENT_RDY_INT_POS (12)
#define H26E_SW_ENC_01_STRM_SEGMENT_RDY_INT_MASK (0x1)

#define H26E_SW_ENC_01_RESERVED_BIT_13_15_POS (13)
#define H26E_SW_ENC_01_RESERVED_BIT_13_15_MASK (0x7)

#define H26E_SW_ENC_01_IRQ_TYPE_FRAME_RDY_POS (16)
#define H26E_SW_ENC_01_IRQ_TYPE_FRAME_RDY_MASK (0x1)

#define H26E_SW_ENC_01_IRQ_TYPE_SLICE_RDY_POS (17)
#define H26E_SW_ENC_01_IRQ_TYPE_SLICE_RDY_MASK (0x1)

#define H26E_SW_ENC_01_IRQ_TYPE_LINE_BUFFER_POS (18)
#define H26E_SW_ENC_01_IRQ_TYPE_LINE_BUFFER_MASK (0x1)

#define H26E_SW_ENC_01_IRQ_TYPE_STRM_SEGMENT_POS (19)
#define H26E_SW_ENC_01_IRQ_TYPE_STRM_SEGMENT_MASK (0x1)

#define H26E_SW_ENC_01_IRQ_TYPE_TIMEOUT_POS (20)
#define H26E_SW_ENC_01_IRQ_TYPE_TIMEOUT_MASK (0x1)

#define H26E_SW_ENC_01_IRQ_TYPE_BUS_ERROR_POS (21)
#define H26E_SW_ENC_01_IRQ_TYPE_BUS_ERROR_MASK (0x1)

#define H26E_SW_ENC_01_IRQ_TYPE_BUFFER_FULL_POS (22)
#define H26E_SW_ENC_01_IRQ_TYPE_BUFFER_FULL_MASK (0x1)

#define H26E_SW_ENC_01_IRQ_TYPE_FUSE_ERROR_POS (23)
#define H26E_SW_ENC_01_IRQ_TYPE_FUSE_ERROR_MASK (0x1)

#define H26E_SW_ENC_01_IRQ_TYPE_SW_RESET_POS (24)
#define H26E_SW_ENC_01_IRQ_TYPE_SW_RESET_MASK (0x1)

#define H26E_SW_ENC_01_RESERVED_BIT_25_31_POS (25)
#define H26E_SW_ENC_01_RESERVED_BIT_25_31_MASK (0x7f)

#define H26E_SW_ENC_02_ADDR (SOC_H26E_REG_BASE + (0x2 << 2))

#define H26E_SW_ENC_02_CTB_RC_MEM_OUT_SWAP_POS (0)
#define H26E_SW_ENC_02_CTB_RC_MEM_OUT_SWAP_MASK (0xf)

#define H26E_SW_ENC_02_ROI_MAP_QP_DELTA_MAP_SWAP_POS (4)
#define H26E_SW_ENC_02_ROI_MAP_QP_DELTA_MAP_SWAP_MASK (0xf)

#define H26E_SW_ENC_02_PIC_SWAP_POS (8)
#define H26E_SW_ENC_02_PIC_SWAP_MASK (0xf)

#define H26E_SW_ENC_02_STRM_SWAP_POS (12)
#define H26E_SW_ENC_02_STRM_SWAP_MASK (0xf)

#define H26E_SW_ENC_02_AXI_READ_ID_POS (16)
#define H26E_SW_ENC_02_AXI_READ_ID_MASK (0xff)

#define H26E_SW_ENC_02_AXI_WRITE_ID_POS (24)
#define H26E_SW_ENC_02_AXI_WRITE_ID_MASK (0xff)

#define H26E_SW_ENC_03_ADDR (SOC_H26E_REG_BASE + (0x3 << 2))

#define H26E_SW_ENC_03_RESERVED_BIT_0_0_POS (0)
#define H26E_SW_ENC_03_RESERVED_BIT_0_0_MASK (0x1)

#define H26E_SW_ENC_03_STRM_SEGMENT_INT_POS (1)
#define H26E_SW_ENC_03_STRM_SEGMENT_INT_MASK (0x1)

#define H26E_SW_ENC_03_LINE_BUFFER_INT_POS (2)
#define H26E_SW_ENC_03_LINE_BUFFER_INT_MASK (0x1)

#define H26E_SW_ENC_03_SLICE_INT_POS (3)
#define H26E_SW_ENC_03_SLICE_INT_MASK (0x1)

#define H26E_SW_ENC_03_AXI_AW_QOS_POS (4)
#define H26E_SW_ENC_03_AXI_AW_QOS_MASK (0xf)

#define H26E_SW_ENC_03_AXI_AR_QOS_POS (8)
#define H26E_SW_ENC_03_AXI_AR_QOS_MASK (0xf)

#define H26E_SW_ENC_03_RESERVED_BIT_12_18_POS (12)
#define H26E_SW_ENC_03_RESERVED_BIT_12_18_MASK (0x7f)

#define H26E_SW_ENC_03_SRAM_POWER_DOWN_DISABLE_POS (19)
#define H26E_SW_ENC_03_SRAM_POWER_DOWN_DISABLE_MASK (0x1)

#define H26E_SW_ENC_03_CU_INFO_MEM_OUT_SWAP_POS (20)
#define H26E_SW_ENC_03_CU_INFO_MEM_OUT_SWAP_MASK (0xf)

#define H26E_SW_ENC_03_AXI_RD_ID_E_POS (24)
#define H26E_SW_ENC_03_AXI_RD_ID_E_MASK (0x1)

#define H26E_SW_ENC_03_AXI_WR_ID_E_POS (25)
#define H26E_SW_ENC_03_AXI_WR_ID_E_MASK (0x1)

#define H26E_SW_ENC_03_CLOCK_GATE_INTER_H264_E_POS (26)
#define H26E_SW_ENC_03_CLOCK_GATE_INTER_H264_E_MASK (0x1)

#define H26E_SW_ENC_03_CLOCK_GATE_INTER_H265_E_POS (27)
#define H26E_SW_ENC_03_CLOCK_GATE_INTER_H265_E_MASK (0x1)

#define H26E_SW_ENC_03_CLOCK_GATE_INTER_E_POS (28)
#define H26E_SW_ENC_03_CLOCK_GATE_INTER_E_MASK (0x1)

#define H26E_SW_ENC_03_CLOCK_GATE_ENCODER_H264_E_POS (29)
#define H26E_SW_ENC_03_CLOCK_GATE_ENCODER_H264_E_MASK (0x1)

#define H26E_SW_ENC_03_CLOCK_GATE_ENCODER_H265_E_POS (30)
#define H26E_SW_ENC_03_CLOCK_GATE_ENCODER_H265_E_MASK (0x1)

#define H26E_SW_ENC_03_CLOCK_GATE_ENCODER_E_POS (31)
#define H26E_SW_ENC_03_CLOCK_GATE_ENCODER_E_MASK (0x1)

#define H26E_SW_ENC_115_ADDR (SOC_H26E_REG_BASE + (0x115 << 2))

#define H26E_SW_ENC_115_PRPSBI_ID_0_POS (0)
#define H26E_SW_ENC_115_PRPSBI_ID_0_MASK (0x1f)

#define H26E_SW_ENC_115_SYN_AMOUNT_PER_LOOPBACK_POS (5)
#define H26E_SW_ENC_115_SYN_AMOUNT_PER_LOOPBACK_MASK (0x7fff)

#define H26E_SW_ENC_115_PIC_ORDER_CNT_TYPE_POS (20)
#define H26E_SW_ENC_115_PIC_ORDER_CNT_TYPE_MASK (0x3)

#define H26E_SW_ENC_115_LOG2_MAX_FRAME_NUM_POS (22)
#define H26E_SW_ENC_115_LOG2_MAX_FRAME_NUM_MASK (0x1f)

#define H26E_SW_ENC_115_LOG2_MAX_PIC_ORDER_CNT_LSB_POS (27)
#define H26E_SW_ENC_115_LOG2_MAX_PIC_ORDER_CNT_LSB_MASK (0x1f)

#ifdef __cplusplus
}
#endif
